import streamlit as st

st.title("개념기반 탐구학습🤓")
st.image("image3.png", caption="개념기반 탐구학습의 수업 디자인")
st.subheader(
    "개념기반 탐구학습에서는 교육과정, 수업, 평가에서 탐구 질문을 핵심 질문으로 삼을 것을 강조한다."
)
st.text(
    "•개방형 질문, 하나의 정답이 없는 질문 /n •사고를 촉발하는 질문 /n •고차원적 사고 질문 /n •다른 분야로 전이가 가능한 질문 /n •답 자체를 넘어 정당한 근거를 요구하는 질문 /n •반복할 수 있는 질문"
)
st.subheader("개념기반 탐구학습 모델은 다음의 절차를 강조한다.")
st.text(
    "개념기반 탐구학습 모델은 기본적으로 연역적 수업디자인 방식과 귀납적인 수업디자인 방식을 결합한 것이지만 탐구학습을 통해 좀 더 귀납적인 수업디자인 방식에 강조를 두고 있다. 즉, 정답을 말하고 이를 익히거나 그 근거를 배우는 것이 아니라 질문하고 이에 따라 탐구하고, 개념을 이해하고, 이를 기반으로 심화 내지 적용을 해나가는 방식이다. 정답을 배우고 활동하는 것이 아니라 탐구활동을 통해 해답을 찾아가는 방식이다."
)
st.image("image1.png", caption="개념기반 탐구학습 모델 절차")
st.text(
    "핵심 질문은 학습 목표와 학습 주제에 대한 깊이있는 교사의 고민이 결합되어야 나올 수 있는 질문이다. 그리고 교과 특성이나 주제에 따라서 내용적 지식 뿐 아니라 과정적 지식이 핵심 질문이 될 수 있다. 지식 뿐 아니라 기능이나 태도, 가치 등이 핵심 질문이 될 수 있다. "
)
st.text(
    "출발 질문은 도입에 해당하는 질문으로, 학습 주제와 학생들의 구체적인 삶을 연결함으로써 흥미와 지적 호기심을 자극하고 학생들을 수업에 참여시키기 위한 질문이다."
)
st.text(
    "전개 질문은 본시 학습에서 다루는 학습내용에 관한 질문으로, 주로 지식과 이해를 묻는 수렴적 질문, 닫힌 질문을 자주 사용한다."
)
st.text(
    "도착 질문은 배운 지식과 실제 삶을 연결하는 질문으로, 적용, 분석, 종합, 평가에 해당하는 발산적 질문, 열린 질문이다."
)
st.image("image2.png", caption="핵심 질문, 출발 질문, 전개 질문, 도착 질문의 사례")
